sdima1357/stm32f407vg_RGB64x32x2_LED_PANEL/stm32f407vg_compact_panel/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2020 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY1_Pin GPIO_PIN_0
#define KEY1_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_1
#define LED_GPIO_Port GPIOA
#define SB2_Pin GPIO_PIN_2
#define SB2_GPIO_Port GPIOA
#define SR2_Pin GPIO_PIN_3
#define SR2_GPIO_Port GPIOA
#define SG2_Pin GPIO_PIN_4
#define SG2_GPIO_Port GPIOA
#define OE_BLANK_Pin GPIO_PIN_5
#define OE_BLANK_GPIO_Port GPIOA
#define LATCH_Pin GPIO_PIN_6
#define LATCH_GPIO_Port GPIOA
#define CLK_Pin GPIO_PIN_7
#define CLK_GPIO_Port GPIOA
#define LINE_D_Pin GPIO_PIN_4
#define LINE_D_GPIO_Port GPIOC
#define LINE_C_Pin GPIO_PIN_5
#define LINE_C_GPIO_Port GPIOC
#define LINE_B_Pin GPIO_PIN_0
#define LINE_B_GPIO_Port GPIOB
#define LINE_A_Pin GPIO_PIN_1
#define LINE_A_GPIO_Port GPIOB
#define SB1_Pin GPIO_PIN_7
#define SB1_GPIO_Port GPIOE
#define B2_Pin GPIO_PIN_8
#define B2_GPIO_Port GPIOE
#define G2_Pin GPIO_PIN_9
#define G2_GPIO_Port GPIOE
#define R2_Pin GPIO_PIN_10
#define R2_GPIO_Port GPIOE
#define SG1_Pin GPIO_PIN_11
#define SG1_GPIO_Port GPIOE
#define B1_Pin GPIO_PIN_12
#define B1_GPIO_Port GPIOE
#define G1_Pin GPIO_PIN_13
#define G1_GPIO_Port GPIOE
#define R1_Pin GPIO_PIN_14
#define R1_GPIO_Port GPIOE
#define SR1_Pin GPIO_PIN_15
#define SR1_GPIO_Port GPIOE
#define SD_MISO_Pin GPIO_PIN_8
#define SD_MISO_GPIO_Port GPIOC
#define FLASH_CS_Pin GPIO_PIN_15
#define FLASH_CS_GPIO_Port GPIOA
#define SD_CS_Pin GPIO_PIN_11
#define SD_CS_GPIO_Port GPIOC
#define SD_CLK_Pin GPIO_PIN_12
#define SD_CLK_GPIO_Port GPIOC
#define SD_MOSI_Pin GPIO_PIN_2
#define SD_MOSI_GPIO_Port GPIOD
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
